onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wb_rtcc.h
#  define STM32WB_RTC_BKCOUNT       20

/* Register Bitfield Definitions ********************************************/

/* RTC time register */

#define RTC_TR_SU_SHIFT             (0)       /* Bits 0-3: Second units in BCD format */
#define RTC_TR_SU_MASK              (0xf << RTC_TR_SU_SHIFT)
#define RTC_TR_ST_SHIFT             (4)       /* Bits 4-6: Second tens in BCD format */
#define RTC_TR_ST_MASK              (0x7 << RTC_TR_ST_SHIFT)
#define RTC_TR_MNU_SHIFT            (8)       /* Bit 8-11: Minute units in BCD format */
#define RTC_TR_MNU_MASK             (0xf << RTC_TR_MNU_SHIFT)
#define RTC_TR_MNT_SHIFT            (12)      /* Bits 12-14: Minute tens in BCD format */
#define RTC_TR_MNT_MASK             (0x7 << RTC_TR_MNT_SHIFT)
#define RTC_TR_HU_SHIFT             (16)      /* Bit 16-19: Hour units in BCD format */
#define RTC_TR_HU_MASK              (0xf << RTC_TR_HU_SHIFT)
#define RTC_TR_HT_SHIFT             (20)      /* Bits 20-21: Hour tens in BCD format */
#define RTC_TR_HT_MASK              (0x3 << RTC_TR_HT_SHIFT)
#define RTC_TR_PM                   (1 << 22) /* Bit 22: AM/PM notation */
#define RTC_TR_RESERVED_BITS        (0xff808080)

/* RTC date register */

#define RTC_DR_DU_SHIFT             (0)       /* Bits 0-3: Date units in BCD format */
#define RTC_DR_DU_MASK              (0xf << RTC_DR_DU_SHIFT)
#define RTC_DR_DT_SHIFT             (4)       /* Bits 4-5: Date tens in BCD format */
#define RTC_DR_DT_MASK              (0x3 << RTC_DR_DT_SHIFT)
#define RTC_DR_MU_SHIFT             (8)       /* Bits 8-11: Month units in BCD format */
#define RTC_DR_MU_MASK              (0xf << RTC_DR_MU_SHIFT)
#define RTC_DR_MT                   (1 << 12) /* Bit 12: Month tens in BCD format */
#define RTC_DR_WDU_SHIFT            (13)      /* Bits 13-15: Week day units */
#define RTC_DR_WDU_MASK             (0x7 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_MONDAY         (0x1 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_TUESDAY        (0x2 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_WEDNESDAY      (0x3 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_THURSDAY       (0x4 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_FRIDAY         (0x5 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_SATURDAY       (0x6 << RTC_DR_WDU_SHIFT)
#  define RTC_DR_WDU_SUNDAY         (0x7 << RTC_DR_WDU_SHIFT)
#define RTC_DR_YU_SHIFT             (16)      /* Bits 16-19: Year units in BCD format */
#define RTC_DR_YU_MASK              (0xf << RTC_DR_YU_SHIFT)
#define RTC_DR_YT_SHIFT             (20)      /* Bits 20-23: Year tens in BCD format */
#define RTC_DR_YT_MASK              (0xf << RTC_DR_YT_SHIFT)
#define RTC_DR_RESERVED_BITS        (0xff0000c0)

/* RTC control register */

#define RTC_CR_WUCKSEL_SHIFT        (0)      /* Bits 0-2: Wakeup clock selection */
#define RTC_CR_WUCKSEL_MASK         (0x7 << RTC_CR_WUCKSEL_SHIFT)
#  define RTC_CR_WUCKSEL_RTCDIV16   (0x0 << RTC_CR_WUCKSEL_SHIFT) /* 000: RTC/16 clock is selected */
#  define RTC_CR_WUCKSEL_RTCDIV8    (0x1 << RTC_CR_WUCKSEL_SHIFT) /* 001: RTC/8 clock is selected */
#  define RTC_CR_WUCKSEL_RTCDIV4    (0x2 << RTC_CR_WUCKSEL_SHIFT) /* 010: RTC/4 clock is selected */
#  define RTC_CR_WUCKSEL_RTCDIV2    (0x3 << RTC_CR_WUCKSEL_SHIFT) /* 011: RTC/2 clock is selected */
#  define RTC_CR_WUCKSEL_CKSPRE     (0x4 << RTC_CR_WUCKSEL_SHIFT) /* 10x: ck_spre clock is selected */
#  define RTC_CR_WUCKSEL_CKSPREADD  (0x6 << RTC_CR_WUCKSEL_SHIFT) /* 11x: ck_spre and 2^16 added to WUT counter */
#define RTC_CR_TSEDGE               (1 << 3)  /* Bit 3: Timestamp event active edge */
#  define RTC_CR_TSEDGE_RISING      (0 << 3)  /* 0: Rising edge generates event */
#  define RTC_CR_TSEDGE_FALLING     (1 << 3)  /* 1: Falling edge generates event */
#define RTC_CR_REFCKON              (1 << 4)  /* Bit 4: Reference clock detection enable (50 or 60 Hz) */
#define RTC_CR_BYPSHAD              (1 << 5)  /* Bit 5: Bypass the shadow registers */
#define RTC_CR_FMT                  (1 << 6)  /* Bit 6: Hour format */
#  define RTC_CR_FMT_24             (0 << 6)  /* 0: 24 hour/day format */
#  define RTC_CR_FMT_AMPM           (1 << 6)  /* 1: AM/PM hour format */
#define RTC_CR_ALRAE                (1 << 8)  /* Bit 8: Alarm A enable */
#define RTC_CR_ALRBE                (1 << 9)  /* Bit 9: Alarm B enable */
#define RTC_CR_WUTE                 (1 << 10) /* Bit 10: Wakeup timer enable */
#define RTC_CR_TSE                  (1 << 11) /* Bit 11: Time stamp enable */
#define RTC_CR_ALRAIE               (1 << 12) /* Bit 12: Alarm A interrupt enable */
#define RTC_CR_ALRBIE               (1 << 13) /* Bit 13: Alarm B interrupt enable */
#define RTC_CR_WUTIE                (1 << 14) /* Bit 14: Wakeup timer interrupt enable */
#define RTC_CR_TSIE                 (1 << 15) /* Bit 15: Timestamp interrupt enable */
#define RTC_CR_ADD1H                (1 << 16) /* Bit 16: Add 1 hour (summer time change) */
#define RTC_CR_SUB1H                (1 << 17) /* Bit 17: Subtract 1 hour (winter time change) */
#define RTC_CR_BKP                  (1 << 18) /* Bit 18: Backup */
#define RTC_CR_COSEL                (1 << 19) /* Bit 19: Calibration output selection */
#  define RTC_CR_COSEL_512HZ        (0 << 19) /* 0: Calibration output is 512 Hz */
#  define RTC_CR_COSEL_1HZ          (1 << 19) /* 1: Calibration output is 1 Hz */
#define RTC_CR_POL                  (1 << 20) /* Bit 20: Output polarity */
#  define RTC_CR_POL_HIGH           (0 << 20) /* 0: Output pin is High on ALRAF/ALRBF/WUTF */
#  define RTC_CR_POL_LOW            (1 << 20) /* 1: Output pin is Low on ALRAF/ALRBF/WUTF */
#define RTC_CR_OSEL_SHIFT           (21)      /* Bits 21-22: Output selection */
#define RTC_CR_OSEL_MASK            (0x3 << RTC_CR_OSEL_SHIFT)
#  define RTC_CR_OSEL_DISABLED      (0x0 << RTC_CR_OSEL_SHIFT) /* 00: Output disabled */
#  define RTC_CR_OSEL_ALRMA         (0x1 << RTC_CR_OSEL_SHIFT) /* 01: Alarm A output enabled */
#  define RTC_CR_OSEL_ALRMB         (0x2 << RTC_CR_OSEL_SHIFT) /* 10: Alarm B output enabled */
#  define RTC_CR_OSEL_WUT           (0x3 << RTC_CR_OSEL_SHIFT) /* 11: Wakeup output enabled */
#define RTC_CR_COE                  (1 << 23) /* Bit 23: Calibration output enable */
#define RTC_CR_ITSE                 (1 << 24) /* Bit 24: Timestamp on internal event enable */

/* RTC initialization and status register */

#define RTC_ISR_ALRAWF              (1 << 0)  /* Bit 0: Alarm A write flag */
#define RTC_ISR_ALRBWF              (1 << 1)  /* Bit 1: Alarm B write flag */
#define RTC_ISR_WUTWF               (1 << 2)  /* Bit 2: Wakeup timer write flag */
#define RTC_ISR_SHPF                (1 << 3)  /* Bit 3: Shift operation pending */
#define RTC_ISR_INITS               (1 << 4)  /* Bit 4: Initialization status flag */
#define RTC_ISR_RSF                 (1 << 5)  /* Bit 5: Registers synchronization flag */
#define RTC_ISR_INITF               (1 << 6)  /* Bit 6: Initialization flag */
#define RTC_ISR_INIT                (1 << 7)  /* Bit 7: Initialization mode */
#define RTC_ISR_ALRAF               (1 << 8)  /* Bit 8: Alarm A flag */
#define RTC_ISR_ALRBF               (1 << 9)  /* Bit 9: Alarm B flag */
#define RTC_ISR_WUTF                (1 << 10) /* Bit 10: Wakeup timer flag */
#define RTC_ISR_TSF                 (1 << 11) /* Bit 11: Time-stamp flag */
#define RTC_ISR_TSOVF               (1 << 12) /* Bit 12: Timestamp overflow flag */
#define RTC_ISR_TAMP1F              (1 << 13) /* Bit 13: Tamper 1 detection flag */
#define RTC_ISR_TAMP2F              (1 << 14) /* Bit 14: Tamper 2 detection flag */
#define RTC_ISR_TAMP3F              (1 << 15) /* Bit 15: Tamper 3 detection flag */
#define RTC_ISR_RECALPF             (1 << 16) /* Bit 16: Recalibration pending flag */
#define RTC_ISR_ITSF                (1 << 17) /* Bit 17: Internal time-stamp flag */
#define RTC_ISR_ALLFLAGS            (0x0003ffff)

/* RTC prescaler register */

#define RTC_PRER_PREDIV_S_SHIFT     (0)       /* Bits 0-14: Synchronous prescaler factor */
#define RTC_PRER_PREDIV_S_MASK      (0x7fff << RTC_PRER_PREDIV_S_SHIFT)
#define RTC_PRER_PREDIV_A_SHIFT     (16)      /* Bits 16-22: Asynchronous prescaler factor */
#define RTC_PRER_PREDIV_A_MASK      (0x7f << RTC_PRER_PREDIV_A_SHIFT)

