onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wb_rtcc.h
/* RTC wakeup timer register */

#define RTC_WUTR_SHIFT              (0)       /* Bits 15:0  Wakeup auto-reload value bits */
#define RTC_WUTR_MASK               (0xffff << RTC_WUTR_SHIFT)

/* RTC alarm A/B registers */

#define RTC_ALRMR_SU_SHIFT          (0)       /* Bits 0-3: Second units in BCD format. */
#define RTC_ALRMR_SU_MASK           (0xf << RTC_ALRMR_SU_SHIFT)
#define RTC_ALRMR_ST_SHIFT          (4)       /* Bits 4-6: Second tens in BCD format. */
#define RTC_ALRMR_ST_MASK           (0x7 << RTC_ALRMR_ST_SHIFT)
#define RTC_ALRMR_MSK1              (1 << 7)  /* Bit 7: Alarm A/B seconds mask */
#define RTC_ALRMR_MNU_SHIFT         (8)       /* Bits 8-11: Minute units in BCD format. */
#define RTC_ALRMR_MNU_MASK          (0xf << RTC_ALRMR_MNU_SHIFT)
#define RTC_ALRMR_MNT_SHIFT         (12)      /* Bits 12-14: Minute tens in BCD format. */
#define RTC_ALRMR_MNT_MASK          (0x7 << RTC_ALRMR_MNT_SHIFT)
#define RTC_ALRMR_MSK2              (1 << 15) /* Bit 15: Alarm A/B minutes mask */
#define RTC_ALRMR_HU_SHIFT          (16)      /* Bits 16-19: Hour units in BCD format. */
#define RTC_ALRMR_HU_MASK           (15 << RTC_ALRMR_HU_SHIFT)
#define RTC_ALRMR_HT_SHIFT          (20)      /* Bits 20-21: Hour tens in BCD format. */
#define RTC_ALRMR_HT_MASK           (0x3 << RTC_ALRMR_HT_SHIFT)
#define RTC_ALRMR_PM                (1 << 22) /* Bit 22: AM/PM notation */
#define RTC_ALRMR_MSK3              (1 << 23) /* Bit 23: Alarm A/B hours mask */
#define RTC_ALRMR_DU_SHIFT          (24)      /* Bits 24-27: Date units or day in BCD format. */
#define RTC_ALRMR_DU_MASK           (0xf << RTC_ALRMR_DU_SHIFT)
#define RTC_ALRMR_DT_SHIFT          (28)      /* Bits 28-29: Date tens in BCD format. */
#define RTC_ALRMR_DT_MASK           (0x3 << RTC_ALRMR_DT_SHIFT)
#define RTC_ALRMR_WDSEL             (1 << 30) /* Bit 30: Week day selection */
#define RTC_ALRMR_MSK4              (1 << 31) /* Bit 31: Alarm A/B date mask */

/* RTC write protection register */

#define RTC_WPR_KEY_SHIFT           (0)       /* Bits 0-7: Write protection key */
#define RTC_WPR_KEY_MASK            (0xff << RTC_WPR_KEY_SHIFT)

/* RTC sub second register */

#define RTC_SSR_SHIFT               (0)       /* Bits 0-15: Sub second value */
#define RTC_SSR_MASK                (0xffff << RTC_SSR_SHIFT)

/* RTC shift control register */

#define RTC_SHIFTR_SUBFS_SHIFT      (0)       /* Bits 0-14: Subtract a fraction of a second */
#define RTC_SHIFTR_SUBFS_MASK       (0x7fff << RTC_SHIFTR_SUBFS_SHIFT)
#define RTC_SHIFTR_ADD1S            (1 << 31) /* Bit 31: Add one second */

/* RTC time-stamp time register */

#define RTC_TSTR_SU_SHIFT           (0)       /* Bits 0-3: Second units in BCD format. */
#define RTC_TSTR_SU_MASK            (0xf << RTC_TSTR_SU_SHIFT)
#define RTC_TSTR_ST_SHIFT           (4)       /* Bits 4-6: Second tens in BCD format. */
#define RTC_TSTR_ST_MASK            (0x7 << RTC_TSTR_ST_SHIFT)
#define RTC_TSTR_MNU_SHIFT          (8)       /* Bits 8-11: Minute units in BCD format. */
#define RTC_TSTR_MNU_MASK           (0xf << RTC_TSTR_MNU_SHIFT)
#define RTC_TSTR_MNT_SHIFT          (12)      /* Bits 12-14: Minute tens in BCD format. */
#define RTC_TSTR_MNT_MASK           (0x7 << RTC_TSTR_MNT_SHIFT)
#define RTC_TSTR_HU_SHIFT           (16)      /* Bits 16-19: Hour units in BCD format. */
#define RTC_TSTR_HU_MASK            (0xf << RTC_TSTR_HU_SHIFT)
#define RTC_TSTR_HT_SHIFT           (20)      /* Bits 20-21: Hour tens in BCD format. */
#define RTC_TSTR_HT_MASK            (0x3 << RTC_TSTR_HT_SHIFT)
#define RTC_TSTR_PM                 (1 << 22) /* Bit 22: AM/PM notation */

/* RTC time-stamp date register */

#define RTC_TSDR_DU_SHIFT           (0)       /* Bit 0-3: Date units in BCD format */
#define RTC_TSDR_DU_MASK            (0xf << RTC_TSDR_DU_SHIFT)
#define RTC_TSDR_DT_SHIFT           (4)       /* Bits 4-5: Date tens in BCD format */
#define RTC_TSDR_DT_MASK            (0x3 << RTC_TSDR_DT_SHIFT)
#define RTC_TSDR_MU_SHIFT           (8)       /* Bits 8-11: Month units in BCD format */
#define RTC_TSDR_MU_MASK            (0xf << RTC_TSDR_MU_SHIFT)
#define RTC_TSDR_MT                 (1 << 12) /* Bit 12: Month tens in BCD format */
#define RTC_TSDR_WDU_SHIFT          (13)      /* Bits 13-15: Week day units */
#define RTC_TSDR_WDU_MASK           (0x7 << RTC_TSDR_WDU_SHIFT)

/* RTC time-stamp sub second register */

#define RTC_TSSSR_SHIFT             (0)       /* Bits 0-15: Sub second value */
#define RTC_TSSSR_MASK              (0xffff << RTC_TSSSR_SHIFT)

/* RTC calibration register */

#define RTC_CALR_CALM_SHIFT         (0)       /* Bits 0-8: Calibration minus */
#define RTC_CALR_CALM_MASK          (0x1ff << RTC_CALR_CALM_SHIFT)
#define RTC_CALR_CALW16             (1 << 13) /* Bit 13: Use a 16-second calibration cycle period */
#define RTC_CALR_CALW8              (1 << 14) /* Bit 14: Use an 8-second calibration cycle period */
#define RTC_CALR_CALP               (1 << 15) /* Bit 15: Increase frequency of RTC by 488.5 ppm */

/* RTC tamper configuration register */

#define RTC_TAMPCR_TAMP1E             (1 << 0)  /* Bit 0: Tamper 1 input detection enable */
#define RTC_TAMPCR_TAMP1TRG           (1 << 1)  /* Bit 1: Active level for Tamper 1 input */
#define RTC_TAMPCR_TAMPIE             (1 << 2)  /* Bit 2: Tamper interrupt enable */
#define RTC_TAMPCR_TAMP2E             (1 << 3)  /* Bit 3: Tamper 2 detection enable */
#define RTC_TAMPCR_TAMP2TRG           (1 << 4)  /* Bit 4: Active level for Tamper 2 input */
#define RTC_TAMPCR_TAMP3E             (1 << 5)  /* Bit 5: Tamper 3 detection enable */
#define RTC_TAMPCR_TAMP3TRG           (1 << 6)  /* Bit 6: Active level for Tamper 3 input */
#define RTC_TAMPCR_TAMPTS             (1 << 7)  /* Bit 7: Activate timestamp on tamper detection event */
#define RTC_TAMPCR_TAMPFREQ_SHIFT     (8)       /* Bits 8-10: Tamper sampling frequency */
#define RTC_TAMPCR_TAMPFREQ_MASK      (0x7 << RTC_TAMPCR_TAMPFREQ_SHIFT)
#  define RTC_TAMPCR_TAMPFREQ_d32768  (0x0 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 32768 (1 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d16384  (0x1 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 16384 (2 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d8192   (0x2 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 8192 (4 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d4096   (0x3 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 4096 (8 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d2048   (0x4 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 2048 (16 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d1024   (0x5 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 1024 (32 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d512    (0x6 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 512 (64 Hz) */
#  define RTC_TAMPCR_TAMPFREQ_d256    (0x7 << RTC_TAMPCR_TAMPFREQ_SHIFT) /* RTCCLK / 256 (128 Hz) */
#define RTC_TAMPCR_TAMPFLT_SHIFT      (11)        /* Bits 11-12: RTC_TAMPx filter count */
#define RTC_TAMPCR_TAMPFLT_MASK       (0x3 << RTC_TAMPCR_TAMPFLT_SHIFT)
#define RTC_TAMPCR_TAMPPRCH_SHIFT     (13)        /* Bits 13-14: RTC_TAMPx precharge duration */
#define RTC_TAMPCR_TAMPPRCH_MASK      (0x3 << RTC_TAMPCR_TAMPPRCH_SHIFT)
#  define RTC_TAMPCR_TAMPPRCH_1CYCLE  (0x0 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 1 RTCCLK cycle */
#  define RTC_TAMPCR_TAMPPRCH_2CYCLES (0x1 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 2 RTCCLK cycles */
#  define RTC_TAMPCR_TAMPPRCH_4CYCLES (0x2 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 4 RTCCLK cycles */
#  define RTC_TAMPCR_TAMPPRCH_5CYCLES (0x3 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 8 RTCCLK cycles */
#define RTC_TAMPCR_TAMPPUDIS          (1 << 15) /* Bit 15: Tampers pull-up disable */
#define RTC_TAMPCR_TAMP1IE            (1 << 16) /* Bit 16: Tamper 1 interrupt enable */
#define RTC_TAMPCR_TAMP1NOERASE       (1 << 17) /* Bit 17: Tamper 1 no erase */
#define RTC_TAMPCR_TAMP1MF            (1 << 18) /* Bit 18: Tamper 1 mask flag */
#define RTC_TAMPCR_TAMP2IE            (1 << 19) /* Bit 19: Tamper 2 interrupt enable */
#define RTC_TAMPCR_TAMP2NOERASE       (1 << 20) /* Bit 20: Tamper 2 no erase */
#define RTC_TAMPCR_TAMP2MF            (1 << 21) /* Bit 21: Tamper 2 mask flag */
#define RTC_TAMPCR_TAMP3IE            (1 << 22) /* Bit 22: Tamper 3 interrupt enable */
#define RTC_TAMPCR_TAMP3NOERASE       (1 << 23) /* Bit 23: Tamper 3 no erase */
#define RTC_TAMPCR_TAMP3MF            (1 << 24) /* Bit 24: Tamper 3 mask flag */

/* RTC alarm A/B sub second register */

#define RTC_ALRMSSR_SS_SHIFT        (0)       /* Bits 0-14: Sub second value */
#define RTC_ALRMSSR_SS_MASK         (0x7fff << RTC_ALRMSSR_SS_SHIFT)
#define RTC_ALRMSSR_MASKSS_SHIFT    (24)      /* Bits 24-27: Mask the most-significant bits starting at this bit */
#define RTC_ALRMSSR_MASKSS_MASK     (0xf << RTC_ALRMSSR_MASKSS_SHIFT)

/* RTC option register */

#define RTC_OR_ALARMTYPE            (1 << 0)  /* Bit 0: RTC alarm output type on PC13 (PP/OD) */
#  define RTC_OR_ALARMTYPE_OD       (0 << 0)  /* 0: Open-drain output when mapped to PC13 */
#  define RTC_OR_ALARMTYPE_PP       (1 << 0)  /* 1: Push-pull output when mapped to PC13 */
#define RTC_OR_OUTRMP               (1 << 1)  /* Bit 1: Output remap */
#  define RTC_OR_OUTRMP_PC13        (0 << 1)  /* 0: Alarm/calibration output on PC13 */
#  define RTC_OR_OUTRMP_PB2PC13     (1 << 1)  /* 1: Alarm/calibration output on PB2 or PC13 */

#endif /* __ARCH_ARM_SRC_STM32WB_HARDWARE_STM32WB_RTCC_H */
